----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1       [-1, 32, 1023, 1023]           1,568
   OffsetPredictor-2       [-1, 32, 1023, 1023]               0
      DeformConv2d-3      [-1, 128, 1023, 1023]           6,272
       BatchNorm2d-4      [-1, 128, 1023, 1023]             256
         LeakyReLU-5      [-1, 128, 1023, 1023]               0
         Dropout2d-6      [-1, 128, 1023, 1023]               0
         AvgPool2d-7        [-1, 128, 511, 511]               0
            Conv2d-8         [-1, 32, 510, 510]          65,568
   OffsetPredictor-9         [-1, 32, 510, 510]               0
     DeformConv2d-10         [-1, 96, 510, 510]         196,704
      BatchNorm2d-11         [-1, 96, 510, 510]             192
        LeakyReLU-12         [-1, 96, 510, 510]               0
        Dropout2d-13         [-1, 96, 510, 510]               0
        AvgPool2d-14         [-1, 96, 255, 255]               0
           Conv2d-15         [-1, 32, 254, 254]          49,184
  OffsetPredictor-16         [-1, 32, 254, 254]               0
     DeformConv2d-17         [-1, 64, 254, 254]          98,368
      BatchNorm2d-18         [-1, 64, 254, 254]             128
        LeakyReLU-19         [-1, 64, 254, 254]               0
        Dropout2d-20         [-1, 64, 254, 254]               0
        AvgPool2d-21         [-1, 64, 127, 127]               0
           Conv2d-22         [-1, 32, 126, 126]          32,800
  OffsetPredictor-23         [-1, 32, 126, 126]               0
     DeformConv2d-24         [-1, 32, 126, 126]          32,800
      BatchNorm2d-25         [-1, 32, 126, 126]              64
        LeakyReLU-26         [-1, 32, 126, 126]               0
        Dropout2d-27         [-1, 32, 126, 126]               0
        AvgPool2d-28           [-1, 32, 63, 63]               0
           Conv2d-29           [-1, 32, 62, 62]          16,416
  OffsetPredictor-30           [-1, 32, 62, 62]               0
     DeformConv2d-31           [-1, 16, 62, 62]           8,208
      BatchNorm2d-32           [-1, 16, 62, 62]              32
        LeakyReLU-33           [-1, 16, 62, 62]               0
        Dropout2d-34           [-1, 16, 62, 62]               0
        AvgPool2d-35           [-1, 16, 31, 31]               0
          Flatten-36                [-1, 15376]               0
          Dropout-37                [-1, 15376]               0
           Linear-38                 [-1, 4096]      62,984,192
      BatchNorm1d-39                 [-1, 4096]           8,192
        LeakyReLU-40                 [-1, 4096]               0
           Linear-41                  [-1, 512]       2,097,664
      BatchNorm1d-42                  [-1, 512]           1,024
        LeakyReLU-43                  [-1, 512]               0
           Linear-44                   [-1, 64]          32,832
      BatchNorm1d-45                   [-1, 64]             128
        LeakyReLU-46                   [-1, 64]               0
           Linear-47                    [-1, 7]             455
================================================================
Total params: 65,633,047
Trainable params: 65,633,047
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 12.00
Forward/backward pass size (MB): 5984.47
Params size (MB): 250.37
Estimated Total Size (MB): 6246.84
----------------------------------------------------------------
